{
  "welcome": 
    [ 
      "Hello!", 
      "I hope you have landed on this <a>site</a> because you are looking to make an informed vote in ongoing BC referendum on proportional representation. This little app was designed to aid your understanding of the proposed changes with a hands-on example.",
      "The toggle just below this box switches the seat allocation algorithm from First-Past-The-Post (FPTP) between Mixed-Member-Proportional (MMP), changing the make-up of parliament.",
      "The slider dials on the right are adjustable, so that one can configure different election outcomes for individual districts, also affecting the distributinon of seats in legislature.",
      "Have fun!"
   ],
  "district": "Each colored slider bar represents the vote split in one district, or - in BC terminology - electoral riding. Every district sends 1 directly elected MLA to parliament. This candidate garnered the most vote in their district, not requiring majority. The color of the bottom border of each district displays the party that this candidate belongs to. Make sure to adjust the sliders and see the difference it makes in Parliament!",
  "region": "These groups of 4 districts represent so-called regions, being made up of multiple districts. In reality, these regions could hold any number of districts, most likely proportional to regional population. In this showcase, every region elects 4 district MLAs. The colored border at the bottom of a district shows which party won the district seat. Every region, then, implicitly elects 2 regional MLAs that are chosen so that the delegation of 6 MLA's sent to legislature will more accurately (but not perfectly) represent the popular vote in that specific region. The popular regional vote is represented by the colored bar under each region. This setup gives a ratio of 67% district to 33% regional MLAs in parliament - the guide by BC Elections specifies 'around 60% of district MLAs' should PR pass.",
  "mmp": "This app uses the simplest version of MMP - Mixed Member Proportional: Voters only get one vote on the ballot. Their vote counts both for the district MLA and the overall vote for the region. The 5% threshold for small parties to gain regional seats is not used. This system was because it is the easiest to understand and showcase. There are other versions of MMP in which any voter gets 2 votes but this is beyond the scope of this app. Please visit www.electionsbc.ca for more information. The table included below the parliament compares the popular vote with the de-facto representation through MLAs in legislature for any given party. ",
  "presets": {
    "0": "No weights are applied; vote percentages are completely random.",
    "1": "Blue and Red share at least 60% of the vote in any district. They are always within 10% of each other, without bias towards any one side.",
    "2": "Blue consistently wins between 40 - 60% of the vote in all districts. The remainder is randomly split between Red and Green.",
    "3": "Blue and Red share at least 60% of the vote in each district, Red garnering at most 1% less than Blue. Blue is always within 10% of Red."
  }
}